feaser/openblt/Target/Demo/ARM7_LPC2000_Olimex_LPC_L2294_Crossworks/Boot/lpc2294.h
/* CAN CONTROLLERS AND ACCEPTANCE FILTER */
#define CAN1MOD         (*((volatile unsigned long *) 0xE0044000))      /* All CAN Parts */
#define CAN1CMR         (*((volatile unsigned long *) 0xE0044004))      /* All CAN Parts */
#define CAN1GSR         (*((volatile unsigned long *) 0xE0044008))      /* All CAN Parts */
#define CAN1ICR         (*((volatile unsigned long *) 0xE004400C))      /* All CAN Parts */
#define CAN1IER         (*((volatile unsigned long *) 0xE0044010))      /* All CAN Parts */
#define CAN1BTR         (*((volatile unsigned long *) 0xE0044014))      /* All CAN Parts */
#define CAN1EWL         (*((volatile unsigned long *) 0xE0044018))      /* All CAN Parts */
#define CAN1SR          (*((volatile unsigned long *) 0xE004401C))      /* All CAN Parts */
#define CAN1RFS         (*((volatile unsigned long *) 0xE0044020))      /* All CAN Parts */
#define CAN1RID         (*((volatile unsigned long *) 0xE0044024))      /* All CAN Parts */
#define CAN1RDA         (*((volatile unsigned long *) 0xE0044028))      /* All CAN Parts */
#define CAN1RDB         (*((volatile unsigned long *) 0xE004402C))      /* All CAN Parts */
#define CAN1TFI1        (*((volatile unsigned long *) 0xE0044030))      /* All CAN Parts */
#define CAN1TID1        (*((volatile unsigned long *) 0xE0044034))      /* All CAN Parts */
#define CAN1TDA1        (*((volatile unsigned long *) 0xE0044038))      /* All CAN Parts */
#define CAN1TDB1        (*((volatile unsigned long *) 0xE004403C))      /* All CAN Parts */
#define CAN1TFI2        (*((volatile unsigned long *) 0xE0044040))      /* All CAN Parts */
#define CAN1TID2        (*((volatile unsigned long *) 0xE0044044))      /* All CAN Parts */
#define CAN1TDA2        (*((volatile unsigned long *) 0xE0044048))      /* All CAN Parts */
#define CAN1TDB2        (*((volatile unsigned long *) 0xE004404C))      /* All CAN Parts */
#define CAN1TFI3        (*((volatile unsigned long *) 0xE0044050))      /* All CAN Parts */
#define CAN1TID3        (*((volatile unsigned long *) 0xE0044054))      /* All CAN Parts */
#define CAN1TDA3        (*((volatile unsigned long *) 0xE0044058))      /* All CAN Parts */
#define CAN1TDB3        (*((volatile unsigned long *) 0xE004405C))      /* All CAN Parts */

#define CAN2MOD         (*((volatile unsigned long *) 0xE0048000))      /* All CAN Parts */
#define CAN2CMR         (*((volatile unsigned long *) 0xE0048004))      /* All CAN Parts */
#define CAN2GSR         (*((volatile unsigned long *) 0xE0048008))      /* All CAN Parts */
#define CAN2ICR         (*((volatile unsigned long *) 0xE004800C))      /* All CAN Parts */
#define CAN2IER         (*((volatile unsigned long *) 0xE0048010))      /* All CAN Parts */
#define CAN2BTR         (*((volatile unsigned long *) 0xE0048014))      /* All CAN Parts */
#define CAN2EWL         (*((volatile unsigned long *) 0xE0048018))      /* All CAN Parts */
#define CAN2SR          (*((volatile unsigned long *) 0xE004801C))      /* All CAN Parts */
#define CAN2RFS         (*((volatile unsigned long *) 0xE0048020))      /* All CAN Parts */
#define CAN2RID         (*((volatile unsigned long *) 0xE0048024))      /* All CAN Parts */
#define CAN2RDA         (*((volatile unsigned long *) 0xE0048028))      /* All CAN Parts */
#define CAN2RDB         (*((volatile unsigned long *) 0xE004802C))      /* All CAN Parts */
#define CAN2TFI1        (*((volatile unsigned long *) 0xE0048030))      /* All CAN Parts */
#define CAN2TID1        (*((volatile unsigned long *) 0xE0048034))      /* All CAN Parts */
#define CAN2TDA1        (*((volatile unsigned long *) 0xE0048038))      /* All CAN Parts */
#define CAN2TDB1        (*((volatile unsigned long *) 0xE004803C))      /* All CAN Parts */
#define CAN2TFI2        (*((volatile unsigned long *) 0xE0048040))      /* All CAN Parts */
#define CAN2TID2        (*((volatile unsigned long *) 0xE0048044))      /* All CAN Parts */
#define CAN2TDA2        (*((volatile unsigned long *) 0xE0048048))      /* All CAN Parts */
#define CAN2TDB2        (*((volatile unsigned long *) 0xE004804C))      /* All CAN Parts */
#define CAN2TFI3        (*((volatile unsigned long *) 0xE0048050))      /* All CAN Parts */
#define CAN2TID3        (*((volatile unsigned long *) 0xE0048054))      /* All CAN Parts */
#define CAN2TDA3        (*((volatile unsigned long *) 0xE0048058))      /* All CAN Parts */
#define CAN2TDB3        (*((volatile unsigned long *) 0xE004805C))      /* All CAN Parts */

#define CAN3MOD         (*((volatile unsigned long *) 0xE004C000))      /* lpc2194\lpc2294 only */
#define CAN3CMR         (*((volatile unsigned long *) 0xE004C004))      /* lpc2194\lpc2294 only */
#define CAN3GSR         (*((volatile unsigned long *) 0xE004C008))      /* lpc2194\lpc2294 only */
#define CAN3ICR         (*((volatile unsigned long *) 0xE004C00C))      /* lpc2194\lpc2294 only */
#define CAN3IER         (*((volatile unsigned long *) 0xE004C010))      /* lpc2194\lpc2294 only */
#define CAN3BTR         (*((volatile unsigned long *) 0xE004C014))      /* lpc2194\lpc2294 only */
#define CAN3EWL         (*((volatile unsigned long *) 0xE004C018))      /* lpc2194\lpc2294 only */
#define CAN3SR          (*((volatile unsigned long *) 0xE004C01C))      /* lpc2194\lpc2294 only */
#define CAN3RFS         (*((volatile unsigned long *) 0xE004C020))      /* lpc2194\lpc2294 only */
#define CAN3RID         (*((volatile unsigned long *) 0xE004C024))      /* lpc2194\lpc2294 only */
#define CAN3RDA         (*((volatile unsigned long *) 0xE004C028))      /* lpc2194\lpc2294 only */
#define CAN3RDB         (*((volatile unsigned long *) 0xE004C02C))      /* lpc2194\lpc2294 only */
#define CAN3TFI1        (*((volatile unsigned long *) 0xE004C030))      /* lpc2194\lpc2294 only */
#define CAN3TID1        (*((volatile unsigned long *) 0xE004C034))      /* lpc2194\lpc2294 only */
#define CAN3TDA1        (*((volatile unsigned long *) 0xE004C038))      /* lpc2194\lpc2294 only */
#define CAN3TDB1        (*((volatile unsigned long *) 0xE004C03C))      /* lpc2194\lpc2294 only */
#define CAN3TFI2        (*((volatile unsigned long *) 0xE004C040))      /* lpc2194\lpc2294 only */
#define CAN3TID2        (*((volatile unsigned long *) 0xE004C044))      /* lpc2194\lpc2294 only */
#define CAN3TDA2        (*((volatile unsigned long *) 0xE004C048))      /* lpc2194\lpc2294 only */
#define CAN3TDB2        (*((volatile unsigned long *) 0xE004C04C))      /* lpc2194\lpc2294 only */
#define CAN3TFI3        (*((volatile unsigned long *) 0xE004C050))      /* lpc2194\lpc2294 only */
#define CAN3TID3        (*((volatile unsigned long *) 0xE004C054))      /* lpc2194\lpc2294 only */
#define CAN3TDA3        (*((volatile unsigned long *) 0xE004C058))      /* lpc2194\lpc2294 only */
#define CAN3TDB3        (*((volatile unsigned long *) 0xE004C05C))      /* lpc2194\lpc2294 only */

#define CAN4MOD         (*((volatile unsigned long *) 0xE0050000))      /* lpc2194\lpc2294 only */
#define CAN4CMR         (*((volatile unsigned long *) 0xE0050004))      /* lpc2194\lpc2294 only */
#define CAN4GSR         (*((volatile unsigned long *) 0xE0050008))      /* lpc2194\lpc2294 only */
#define CAN4ICR         (*((volatile unsigned long *) 0xE005000C))      /* lpc2194\lpc2294 only */
#define CAN4IER         (*((volatile unsigned long *) 0xE0050010))      /* lpc2194\lpc2294 only */
#define CAN4BTR         (*((volatile unsigned long *) 0xE0050014))      /* lpc2194\lpc2294 only */
#define CAN4EWL         (*((volatile unsigned long *) 0xE0050018))      /* lpc2194\lpc2294 only */
#define CAN4SR          (*((volatile unsigned long *) 0xE005001C))      /* lpc2194\lpc2294 only */
#define CAN4RFS         (*((volatile unsigned long *) 0xE0050020))      /* lpc2194\lpc2294 only */
#define CAN4RID         (*((volatile unsigned long *) 0xE0050024))      /* lpc2194\lpc2294 only */
#define CAN4RDA         (*((volatile unsigned long *) 0xE0050028))      /* lpc2194\lpc2294 only */
#define CAN4RDB         (*((volatile unsigned long *) 0xE005002C))      /* lpc2194\lpc2294 only */
#define CAN4TFI1        (*((volatile unsigned long *) 0xE0050030))      /* lpc2194\lpc2294 only */
#define CAN4TID1        (*((volatile unsigned long *) 0xE0050034))      /* lpc2194\lpc2294 only */
#define CAN4TDA1        (*((volatile unsigned long *) 0xE0050038))      /* lpc2194\lpc2294 only */
#define CAN4TDB1        (*((volatile unsigned long *) 0xE005003C))      /* lpc2194\lpc2294 only */
#define CAN4TFI2        (*((volatile unsigned long *) 0xE0050040))      /* lpc2194\lpc2294 only */
#define CAN4TID2        (*((volatile unsigned long *) 0xE0050044))      /* lpc2194\lpc2294 only */
#define CAN4TDA2        (*((volatile unsigned long *) 0xE0050048))      /* lpc2194\lpc2294 only */
#define CAN4TDB2        (*((volatile unsigned long *) 0xE005004C))      /* lpc2194\lpc2294 only */
#define CAN4TFI3        (*((volatile unsigned long *) 0xE0050050))      /* lpc2194\lpc2294 only */
#define CAN4TID3        (*((volatile unsigned long *) 0xE0050054))      /* lpc2194\lpc2294 only */
#define CAN4TDA3        (*((volatile unsigned long *) 0xE0050058))      /* lpc2194\lpc2294 only */
#define CAN4TDB3        (*((volatile unsigned long *) 0xE005005C))      /* lpc2194\lpc2294 only */


#define CANTxSR         (*((volatile unsigned long *) 0xE0040000))      /* ALL CAN Parts */
#define CANRxSR         (*((volatile unsigned long *) 0xE0040004))      /* ALL CAN Parts */
#define CANMSR          (*((volatile unsigned long *) 0xE0040008))      /* ALL CAN Parts */

#define CANAFMR         (*((volatile unsigned char *) 0xE003C000))      /* ALL CAN Parts */
#define CANSFF_sa       (*((volatile unsigned short*) 0xE003C004))      /* ALL CAN Parts */
#define CANSFF_GRP_sa   (*((volatile unsigned short*) 0xE003C008))      /* ALL CAN Parts */
#define CANEFF_sa       (*((volatile unsigned short*) 0xE003C00C))      /* ALL CAN Parts */
#define CANEFF_GRP_sa   (*((volatile unsigned short*) 0xE003C010))      /* ALL CAN Parts */
#define CANENDofTable   (*((volatile unsigned short*) 0xE003C014))      /* ALL CAN Parts */
#define CANLUTerrAd     (*((volatile unsigned short*) 0xE003C018))      /* ALL CAN Parts */
#define CANLUTerr       (*((volatile unsigned char *) 0xE003C01C))      /* ALL CAN Parts */


/* Timer 0 */
#define T0IR            (*((volatile unsigned long *) 0xE0004000))
#define T0TCR           (*((volatile unsigned long *) 0xE0004004))
#define T0TC            (*((volatile unsigned long *) 0xE0004008))
#define T0PR            (*((volatile unsigned long *) 0xE000400C))
#define T0PC            (*((volatile unsigned long *) 0xE0004010))
#define T0MCR           (*((volatile unsigned long *) 0xE0004014))
#define T0MR0           (*((volatile unsigned long *) 0xE0004018))
#define T0MR1           (*((volatile unsigned long *) 0xE000401C))
#define T0MR2           (*((volatile unsigned long *) 0xE0004020))
#define T0MR3           (*((volatile unsigned long *) 0xE0004024))
#define T0CCR           (*((volatile unsigned long *) 0xE0004028))
#define T0CR0           (*((volatile unsigned long *) 0xE000402C))
#define T0CR1           (*((volatile unsigned long *) 0xE0004030))
#define T0CR2           (*((volatile unsigned long *) 0xE0004034))
#define T0CR3           (*((volatile unsigned long *) 0xE0004038))
#define T0EMR           (*((volatile unsigned long *) 0xE000403C))

/* Timer 1 */
#define T1IR            (*((volatile unsigned long *) 0xE0008000))
#define T1TCR           (*((volatile unsigned long *) 0xE0008004))
#define T1TC            (*((volatile unsigned long *) 0xE0008008))
#define T1PR            (*((volatile unsigned long *) 0xE000800C))
#define T1PC            (*((volatile unsigned long *) 0xE0008010))
#define T1MCR           (*((volatile unsigned long *) 0xE0008014))
#define T1MR0           (*((volatile unsigned long *) 0xE0008018))
#define T1MR1           (*((volatile unsigned long *) 0xE000801C))
#define T1MR2           (*((volatile unsigned long *) 0xE0008020))
#define T1MR3           (*((volatile unsigned long *) 0xE0008024))
#define T1CCR           (*((volatile unsigned long *) 0xE0008028))
#define T1CR0           (*((volatile unsigned long *) 0xE000802C))
#define T1CR1           (*((volatile unsigned long *) 0xE0008030))
#define T1CR2           (*((volatile unsigned long *) 0xE0008034))
#define T1CR3           (*((volatile unsigned long *) 0xE0008038))
#define T1EMR           (*((volatile unsigned long *) 0xE000803C))

/* Pulse Width Modulator (PWM) */
#define PWMIR           (*((volatile unsigned long *) 0xE0014000))
#define PWMTCR          (*((volatile unsigned long *) 0xE0014004))
#define PWMTC           (*((volatile unsigned long *) 0xE0014008))
#define PWMPR           (*((volatile unsigned long *) 0xE001400C))
#define PWMPC           (*((volatile unsigned long *) 0xE0014010))
#define PWMMCR          (*((volatile unsigned long *) 0xE0014014))
#define PWMMR0          (*((volatile unsigned long *) 0xE0014018))
#define PWMMR1          (*((volatile unsigned long *) 0xE001401C))
#define PWMMR2          (*((volatile unsigned long *) 0xE0014020))
#define PWMMR3          (*((volatile unsigned long *) 0xE0014024))
#define PWMMR4          (*((volatile unsigned long *) 0xE0014040))
#define PWMMR5          (*((volatile unsigned long *) 0xE0014044))
#define PWMMR6          (*((volatile unsigned long *) 0xE0014048))
#define PWMPCR          (*((volatile unsigned long *) 0xE001404C))
#define PWMLER          (*((volatile unsigned long *) 0xE0014050))

/* A/D CONVERTER */
#define ADCR            (*((volatile unsigned long *) 0xE0034000))      /* no in lpc210x*/
#define ADDR            (*((volatile unsigned long *) 0xE0034004))      /* no in lpc210x*/

